Kenzlee51/analyze-tools/lib/adapt-pvs/fake_includes/keil_copied/ARM/Flash/MiMXRT105x_ATXP032/drivers/fsl_clock.h
/*! @brief Clock ip name array for DMAMUX_CLOCKS. */
#define DMAMUX_CLOCKS                                                \
    {                                                                \
        kCLOCK_Dma                                                   \
    }  

/*! @brief Clock ip name array for DMA. */
#define EDMA_CLOCKS                                                  \
    {                                                                \
        kCLOCK_Dma                                                   \
    }    

/*! @brief Clock ip name array for ENC. */
#define ENC_CLOCKS                                                   \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Enc1, kCLOCK_Enc2,                  \
        kCLOCK_Enc3, kCLOCK_Enc4                                     \
    }

/*! @brief Clock ip name array for ENET. */
#define ENET_CLOCKS                                                  \
    {                                                                \
        kCLOCK_Enet                                                  \
    }

/*! @brief Clock ip name array for EWM. */
#define EWM_CLOCKS                                                   \
    {                                                                \
        kCLOCK_Ewm0                                                  \
    }    

/*! @brief Clock ip name array for FLEXCAN. */
#define FLEXCAN_CLOCKS                                               \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Can1, kCLOCK_Can2                   \
    }
    
/*! @brief Clock ip name array for FLEXCAN Peripheral clock. */
#define FLEXCAN_PERIPH_CLOCKS                                        \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Can1S, kCLOCK_Can2S                 \
    }    

/*! @brief Clock ip name array for FLEXIO. */
#define FLEXIO_CLOCKS                                                \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Flexio1, kCLOCK_Flexio2             \
    }

/*! @brief Clock ip name array for FLEXRAM. */
#define FLEXRAM_CLOCKS                                               \
    {                                                                \
        kCLOCK_FlexRam                                               \
    }   

/*! @brief Clock ip name array for FLEXSPI. */
#define FLEXSPI_CLOCKS                                               \
    {                                                                \
        kCLOCK_FlexSpi                                               \
    }   

/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS                                                  \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Gpio1, kCLOCK_Gpio2,                \
        kCLOCK_Gpio3, kCLOCK_Gpio4, kCLOCK_Gpio5                     \
    }

/*! @brief Clock ip name array for GPT. */
#define GPT_CLOCKS                                                   \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Gpt1, kCLOCK_Gpt2                   \
    }

/*! @brief Clock ip name array for KPP. */
#define KPP_CLOCKS                                                   \
    {                                                                \
        kCLOCK_Kpp                                                   \
    }    
    
/*! @brief Clock ip name array for LCDIF. */
#define LCDIF_CLOCKS                                                 \
    {                                                                \
        kCLOCK_Lcd                                                   \
    }

/*! @brief Clock ip name array for LCDIF PIXEL. */
#define LCDIF_PERIPH_CLOCKS                                          \
    {                                                                \
        kCLOCK_LcdPixel                                              \
    }

/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS                                                 \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Lpi2c1, kCLOCK_Lpi2c2,              \
        kCLOCK_Lpi2c3, kCLOCK_Lpi2c4                                 \
    }    

/*! @brief Clock ip name array for LPSPI. */
#define LPSPI_CLOCKS                                                 \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Lpspi1, kCLOCK_Lpspi2,              \
        kCLOCK_Lpspi3, kCLOCK_Lpspi4                                 \
    }       

/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Lpuart1, kCLOCK_Lpuart2,            \
        kCLOCK_Lpuart3, kCLOCK_Lpuart4, kCLOCK_Lpuart5,              \
        kCLOCK_Lpuart6, kCLOCK_Lpuart7, kCLOCK_Lpuart8               \
    }                                                                  

/*! @brief Clock ip name array for PIT. */
#define PIT_CLOCKS                                                   \
    {                                                                \
        kCLOCK_Pit                                                   \
    }

/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                                   \
    {                                                                \
        {                                                            \
            kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_IpInvalid,    \
            kCLOCK_IpInvalid                                         \
        }                                                            \
        ,                                                            \
        {                                                            \
            kCLOCK_Pwm1, kCLOCK_Pwm1,kCLOCK_Pwm1, kCLOCK_Pwm1        \
        }                                                            \
        ,                                                            \
        {                                                            \
            kCLOCK_Pwm2, kCLOCK_Pwm2,kCLOCK_Pwm2, kCLOCK_Pwm2        \
        }                                                            \
        ,                                                            \
        {                                                            \
            kCLOCK_Pwm3, kCLOCK_Pwm3,kCLOCK_Pwm3, kCLOCK_Pwm3        \
        }                                                            \
        ,                                                            \
        {                                                            \
            kCLOCK_Pwm4, kCLOCK_Pwm4,kCLOCK_Pwm4, kCLOCK_Pwm4        \
        }                                                            \
    }   

/*! @brief Clock ip name array for PXP. */
#define PXP_CLOCKS                                                   \
    {                                                                \
        kCLOCK_Pxp                                                   \
    }

