Kenzlee51/analyze-tools/lib/adapt-pvs/fake_includes/keil_copied/ARM/Flash/MiMXRT105x_ATXP032/drivers/fsl_clock.h
/*! @brief Clock ip name array for RTWDOG. */
#define RTWDOG_CLOCKS                                                \
    {                                                                \
        kCLOCK_Wdog3                                                 \
    }    

/*! @brief Clock ip name array for SAI. */
#define SAI_CLOCKS                                                   \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Sai1, kCLOCK_Sai2,                  \
        kCLOCK_Sai3                                                  \
    }

/*! @brief Clock ip name array for SEMC. */
#define SEMC_CLOCKS                                                  \
    {                                                                \
        kCLOCK_Semc                                                  \
    }


/*! @brief Clock ip name array for QTIMER. */
#define TMR_CLOCKS                                                   \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Timer1, kCLOCK_Timer2,              \
        kCLOCK_Timer3, kCLOCK_Timer4                                 \
    }

/*! @brief Clock ip name array for TRNG. */
#define TRNG_CLOCKS                                                  \
    {                                                                \
        kCLOCK_Trng                                                  \
    }

/*! @brief Clock ip name array for TSC. */
#define TSC_CLOCKS                                                   \
    {                                                                \
        kCLOCK_Tsc                                                   \
    }
    
/*! @brief Clock ip name array for WDOG. */
#define WDOG_CLOCKS                                                  \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Wdog1, kCLOCK_Wdog2                 \
    }


/*! @brief Clock ip name array for USDHC. */
#define USDHC_CLOCKS                                                 \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_Usdhc1, kCLOCK_Usdhc2               \
    }
    
/*! @brief Clock ip name array for SPDIF. */
#define SPDIF_CLOCKS                                                 \
    {                                                                \
        kCLOCK_Spdif                                                 \
    }
    
/*! @brief Clock ip name array for XBARA. */
#define XBARA_CLOCKS                                                 \
    {                                                                \
        kCLOCK_Xbar1                                                 \
    }    

/*! @brief Clock ip name array for XBARB. */
#define XBARB_CLOCKS                                                 \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_IpInvalid, kCLOCK_Xbar2,            \
        kCLOCK_Xbar3                                                 \
    }        

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_CpuClk              = 0x0U,         /*!< CPU clock */
    kCLOCK_AhbClk              = 0x1U,         /*!< AHB clock */
    kCLOCK_SemcClk             = 0x2U,         /*!< SEMC clock */
    kCLOCK_IpgClk              = 0x3U,         /*!< IPG clock */

    kCLOCK_OscClk              = 0x4U,         /*!< OSC clock selected by PMU_LOWPWR_CTRL[OSC_SEL]. */
    kCLOCK_RtcClk              = 0x5U,         /*!< RTC clock. (RTCCLK) */

    kCLOCK_ArmPllClk           = 0x6U,         /*!< ARMPLLCLK. */

    kCLOCK_Usb1PllClk          = 0x7U,         /*!< USB1PLLCLK. */
    kCLOCK_Usb1PllPfd0Clk      = 0x8U,         /*!< USB1PLLPDF0CLK. */
    kCLOCK_Usb1PllPfd1Clk      = 0x9U,         /*!< USB1PLLPFD1CLK. */
    kCLOCK_Usb1PllPfd2Clk      = 0xAU,         /*!< USB1PLLPFD2CLK. */
    kCLOCK_Usb1PllPfd3Clk      = 0xBU,         /*!< USB1PLLPFD3CLK. */

    kCLOCK_Usb2PllClk          = 0xCU,         /*!< USB2PLLCLK. */

    kCLOCK_SysPllClk           = 0xDU,         /*!< SYSPLLCLK. */
    kCLOCK_SysPllPfd0Clk       = 0xEU,         /*!< SYSPLLPDF0CLK. */
    kCLOCK_SysPllPfd1Clk       = 0xFU,         /*!< SYSPLLPFD1CLK. */
    kCLOCK_SysPllPfd2Clk       = 0x10U,        /*!< SYSPLLPFD2CLK. */
    kCLOCK_SysPllPfd3Clk       = 0x11U,        /*!< SYSPLLPFD3CLK. */

    kCLOCK_EnetPll0Clk         = 0x12U,        /*!< Enet PLLCLK ref_enetpll0. */
    kCLOCK_EnetPll1Clk         = 0x13U,        /*!< Enet PLLCLK ref_enetpll1. */
    kCLOCK_EnetPll2Clk         = 0x14U,        /*!< Enet PLLCLK ref_enetpll2. */

    kCLOCK_AudioPllClk         = 0x15U,        /*!< Audio PLLCLK. */
    kCLOCK_VideoPllClk         = 0x16U,        /*!< Video PLLCLK. */
} clock_name_t;

#define kCLOCK_CoreSysClk kCLOCK_CpuClk             /*!< For compatible with other platforms without CCM. */
#define CLOCK_GetCoreSysClkFreq CLOCK_GetCpuClkFreq /*!< For compatible with other platforms without CCM. */

/*!
 * @brief CCM CCGR gate control for each module independently.
 */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = -1,

    /* CCM CCGR0 */
    kCLOCK_Aips_tz1            = (0U << 8U) | CCM_CCGR0_CG0_SHIFT,         /*!< CCGR0, CG0   */
    kCLOCK_Aips_tz2            = (0U << 8U) | CCM_CCGR0_CG1_SHIFT,         /*!< CCGR0, CG1   */
                                                                           /*!< CCGR0, CG2, Reserved  */
                                                                           /*!< CCGR0, CG3, Reserved  */
                                                                           /*!< CCGR0, CG4, Reserved  */
    kCLOCK_Dcp                 = (0U << 8U) | CCM_CCGR0_CG5_SHIFT,         /*!< CCGR0, CG5   */
    kCLOCK_Lpuart3             = (0U << 8U) | CCM_CCGR0_CG6_SHIFT,         /*!< CCGR0, CG6   */
    kCLOCK_Can1                = (0U << 8U) | CCM_CCGR0_CG7_SHIFT,         /*!< CCGR0, CG7   */
    kCLOCK_Can1S               = (0U << 8U) | CCM_CCGR0_CG8_SHIFT,         /*!< CCGR0, CG8   */
    kCLOCK_Can2                = (0U << 8U) | CCM_CCGR0_CG9_SHIFT,         /*!< CCGR0, CG9   */
    kCLOCK_Can2S               = (0U << 8U) | CCM_CCGR0_CG10_SHIFT,        /*!< CCGR0, CG10  */
    kCLOCK_Trace               = (0U << 8U) | CCM_CCGR0_CG11_SHIFT,        /*!< CCGR0, CG11  */
    kCLOCK_Gpt2                = (0U << 8U) | CCM_CCGR0_CG12_SHIFT,        /*!< CCGR0, CG12  */
    kCLOCK_Gpt2S               = (0U << 8U) | CCM_CCGR0_CG13_SHIFT,        /*!< CCGR0, CG13  */
    kCLOCK_Lpuart2             = (0U << 8U) | CCM_CCGR0_CG14_SHIFT,        /*!< CCGR0, CG14  */
    kCLOCK_Gpio2               = (0U << 8U) | CCM_CCGR0_CG15_SHIFT,        /*!< CCGR0, CG15  */

    /* CCM CCGR1 */
    kCLOCK_Lpspi1               = (1U << 8U) | CCM_CCGR1_CG0_SHIFT,        /*!< CCGR1, CG0   */
    kCLOCK_Lpspi2               = (1U << 8U) | CCM_CCGR1_CG1_SHIFT,        /*!< CCGR1, CG1   */
    kCLOCK_Lpspi3               = (1U << 8U) | CCM_CCGR1_CG2_SHIFT,        /*!< CCGR1, CG2   */
    kCLOCK_Lpspi4               = (1U << 8U) | CCM_CCGR1_CG3_SHIFT,        /*!< CCGR1, CG3   */
    kCLOCK_Adc_5hc              = (1U << 8U) | CCM_CCGR1_CG4_SHIFT,        /*!< CCGR1, CG4   */
    kCLOCK_Enet                 = (1U << 8U) | CCM_CCGR1_CG5_SHIFT,        /*!< CCGR1, CG5   */
    kCLOCK_Pit                  = (1U << 8U) | CCM_CCGR1_CG6_SHIFT,        /*!< CCGR1, CG6   */
    kCLOCK_Aoi2                 = (1U << 8U) | CCM_CCGR1_CG7_SHIFT,        /*!< CCGR1, CG7   */
    kCLOCK_Adc1                 = (1U << 8U) | CCM_CCGR1_CG8_SHIFT,        /*!< CCGR1, CG8   */
                                                                           /*!< CCGR1, CG9, Reserved  */
    kCLOCK_Gpt1                 = (1U << 8U) | CCM_CCGR1_CG10_SHIFT,       /*!< CCGR1, CG10  */
    kCLOCK_Gpt1S                = (1U << 8U) | CCM_CCGR1_CG11_SHIFT,       /*!< CCGR1, CG11  */
    kCLOCK_Lpuart4              = (1U << 8U) | CCM_CCGR1_CG12_SHIFT,       /*!< CCGR1, CG12  */
    kCLOCK_Gpio1                = (1U << 8U) | CCM_CCGR1_CG13_SHIFT,       /*!< CCGR1, CG13  */
    kCLOCK_Csu                  = (1U << 8U) | CCM_CCGR1_CG14_SHIFT,       /*!< CCGR1, CG14  */
    kCLOCK_Gpio5                = (1U << 8U) | CCM_CCGR1_CG15_SHIFT,       /*!< CCGR1, CG15  */

    /* CCM CCGR2 */
                                                                           /*!< CCGR2, CG0, Reserved  */
    kCLOCK_Csi                  = (2U << 8U) | CCM_CCGR2_CG1_SHIFT,        /*!< CCGR2, CG1   */
    kCLOCK_IomuxcSnvs           = (2U << 8U) | CCM_CCGR2_CG2_SHIFT,        /*!< CCGR2, CG2   */
    kCLOCK_Lpi2c1               = (2U << 8U) | CCM_CCGR2_CG3_SHIFT,        /*!< CCGR2, CG3   */
    kCLOCK_Lpi2c2               = (2U << 8U) | CCM_CCGR2_CG4_SHIFT,        /*!< CCGR2, CG4   */
    kCLOCK_Lpi2c3               = (2U << 8U) | CCM_CCGR2_CG5_SHIFT,        /*!< CCGR2, CG5   */
    kCLOCK_Ocotp                = (2U << 8U) | CCM_CCGR2_CG6_SHIFT,        /*!< CCGR2, CG6   */
    kCLOCK_Xbar3                = (2U << 8U) | CCM_CCGR2_CG7_SHIFT,        /*!< CCGR2, CG7   */
    kCLOCK_Ipmux1               = (2U << 8U) | CCM_CCGR2_CG8_SHIFT,        /*!< CCGR2, CG8   */
    kCLOCK_Ipmux2               = (2U << 8U) | CCM_CCGR2_CG9_SHIFT,        /*!< CCGR2, CG9   */
    kCLOCK_Ipmux3               = (2U << 8U) | CCM_CCGR2_CG10_SHIFT,       /*!< CCGR2, CG10  */
    kCLOCK_Xbar1                = (2U << 8U) | CCM_CCGR2_CG11_SHIFT,       /*!< CCGR2, CG11  */
    kCLOCK_Xbar2                = (2U << 8U) | CCM_CCGR2_CG12_SHIFT,       /*!< CCGR2, CG12  */
    kCLOCK_Gpio3                = (2U << 8U) | CCM_CCGR2_CG13_SHIFT,       /*!< CCGR2, CG13  */
    kCLOCK_Lcd                  = (2U << 8U) | CCM_CCGR2_CG14_SHIFT,       /*!< CCGR2, CG14  */
    kCLOCK_Pxp                  = (2U << 8U) | CCM_CCGR2_CG15_SHIFT,       /*!< CCGR2, CG15  */

