Kenzlee51/analyze-tools/lib/adapt-pvs/fake_includes/keil_copied/ARM/Flash/MiMXRT105x_ATXP032/drivers/fsl_clock.h
    /* CCM CCGR3 */
    kCLOCK_Flexio2              = (3U << 8U) | CCM_CCGR3_CG0_SHIFT,        /*!< CCGR3, CG0   */
    kCLOCK_Lpuart5              = (3U << 8U) | CCM_CCGR3_CG1_SHIFT,        /*!< CCGR3, CG1   */
    kCLOCK_Semc                 = (3U << 8U) | CCM_CCGR3_CG2_SHIFT,        /*!< CCGR3, CG2   */
    kCLOCK_Lpuart6              = (3U << 8U) | CCM_CCGR3_CG3_SHIFT,        /*!< CCGR3, CG3   */
    kCLOCK_Aoi1                 = (3U << 8U) | CCM_CCGR3_CG4_SHIFT,        /*!< CCGR3, CG4   */
    kCLOCK_LcdPixel             = (3U << 8U) | CCM_CCGR3_CG5_SHIFT,        /*!< CCGR3, CG5   */
    kCLOCK_Gpio4                = (3U << 8U) | CCM_CCGR3_CG6_SHIFT,        /*!< CCGR3, CG6   */
    kCLOCK_Ewm0                 = (3U << 8U) | CCM_CCGR3_CG7_SHIFT,        /*!< CCGR3, CG7   */
    kCLOCK_Wdog1                = (3U << 8U) | CCM_CCGR3_CG8_SHIFT,        /*!< CCGR3, CG8   */
    kCLOCK_FlexRam              = (3U << 8U) | CCM_CCGR3_CG9_SHIFT,        /*!< CCGR3, CG9   */
    kCLOCK_Acmp1                = (3U << 8U) | CCM_CCGR3_CG10_SHIFT,       /*!< CCGR3, CG10  */
    kCLOCK_Acmp2                = (3U << 8U) | CCM_CCGR3_CG11_SHIFT,       /*!< CCGR3, CG11  */
    kCLOCK_Acmp3                = (3U << 8U) | CCM_CCGR3_CG12_SHIFT,       /*!< CCGR3, CG12  */
    kCLOCK_Acmp4                = (3U << 8U) | CCM_CCGR3_CG13_SHIFT,       /*!< CCGR3, CG13  */
    kCLOCK_Ocram                = (3U << 8U) | CCM_CCGR3_CG14_SHIFT,       /*!< CCGR3, CG14  */
    kCLOCK_IomuxcSnvsGpr        = (3U << 8U) | CCM_CCGR3_CG15_SHIFT,       /*!< CCGR3, CG15  */

    /* CCM CCGR4 */
    kCLOCK_Iomuxc               = (4U << 8U) | CCM_CCGR4_CG1_SHIFT,        /*!< CCGR4, CG1   */
    kCLOCK_IomuxcGpr            = (4U << 8U) | CCM_CCGR4_CG2_SHIFT,        /*!< CCGR4, CG2   */
    kCLOCK_Bee                  = (4U << 8U) | CCM_CCGR4_CG3_SHIFT,        /*!< CCGR4, CG3   */
    kCLOCK_SimM7                = (4U << 8U) | CCM_CCGR4_CG4_SHIFT,        /*!< CCGR4, CG4   */
    kCLOCK_Tsc                  = (4U << 8U) | CCM_CCGR4_CG5_SHIFT,        /*!< CCGR4, CG5   */
    kCLOCK_SimM                 = (4U << 8U) | CCM_CCGR4_CG6_SHIFT,        /*!< CCGR4, CG6   */
    kCLOCK_SimEms               = (4U << 8U) | CCM_CCGR4_CG7_SHIFT,        /*!< CCGR4, CG7   */
    kCLOCK_Pwm1                 = (4U << 8U) | CCM_CCGR4_CG8_SHIFT,        /*!< CCGR4, CG8   */
    kCLOCK_Pwm2                 = (4U << 8U) | CCM_CCGR4_CG9_SHIFT,        /*!< CCGR4, CG9   */
    kCLOCK_Pwm3                 = (4U << 8U) | CCM_CCGR4_CG10_SHIFT,       /*!< CCGR4, CG10  */
    kCLOCK_Pwm4                 = (4U << 8U) | CCM_CCGR4_CG11_SHIFT,       /*!< CCGR4, CG11  */
    kCLOCK_Enc1                 = (4U << 8U) | CCM_CCGR4_CG12_SHIFT,       /*!< CCGR4, CG12  */
    kCLOCK_Enc2                 = (4U << 8U) | CCM_CCGR4_CG13_SHIFT,       /*!< CCGR4, CG13  */
    kCLOCK_Enc3                 = (4U << 8U) | CCM_CCGR4_CG14_SHIFT,       /*!< CCGR4, CG14  */
    kCLOCK_Enc4                 = (4U << 8U) | CCM_CCGR4_CG15_SHIFT,       /*!< CCGR4, CG15  */

    /* CCM CCGR5 */
    kCLOCK_Rom                  = (5U << 8U) | CCM_CCGR5_CG0_SHIFT,        /*!< CCGR5, CG0   */
    kCLOCK_Flexio1              = (5U << 8U) | CCM_CCGR5_CG1_SHIFT,        /*!< CCGR5, CG1   */
    kCLOCK_Wdog3                = (5U << 8U) | CCM_CCGR5_CG2_SHIFT,        /*!< CCGR5, CG2   */
    kCLOCK_Dma                  = (5U << 8U) | CCM_CCGR5_CG3_SHIFT,        /*!< CCGR5, CG3   */
    kCLOCK_Kpp                  = (5U << 8U) | CCM_CCGR5_CG4_SHIFT,        /*!< CCGR5, CG4   */
    kCLOCK_Wdog2                = (5U << 8U) | CCM_CCGR5_CG5_SHIFT,        /*!< CCGR5, CG5   */
    kCLOCK_Aips_tz4             = (5U << 8U) | CCM_CCGR5_CG6_SHIFT,        /*!< CCGR5, CG6   */
    kCLOCK_Spdif                = (5U << 8U) | CCM_CCGR5_CG7_SHIFT,        /*!< CCGR5, CG7   */
    kCLOCK_SimMain              = (5U << 8U) | CCM_CCGR5_CG8_SHIFT,        /*!< CCGR5, CG8   */
    kCLOCK_Sai1                 = (5U << 8U) | CCM_CCGR5_CG9_SHIFT,        /*!< CCGR5, CG9   */
    kCLOCK_Sai2                 = (5U << 8U) | CCM_CCGR5_CG10_SHIFT,       /*!< CCGR5, CG10  */
    kCLOCK_Sai3                 = (5U << 8U) | CCM_CCGR5_CG11_SHIFT,       /*!< CCGR5, CG11  */
    kCLOCK_Lpuart1              = (5U << 8U) | CCM_CCGR5_CG12_SHIFT,       /*!< CCGR5, CG12  */
    kCLOCK_Lpuart7              = (5U << 8U) | CCM_CCGR5_CG13_SHIFT,       /*!< CCGR5, CG13  */
    kCLOCK_SnvsHp               = (5U << 8U) | CCM_CCGR5_CG14_SHIFT,       /*!< CCGR5, CG14  */
    kCLOCK_SnvsLp               = (5U << 8U) | CCM_CCGR5_CG15_SHIFT,       /*!< CCGR5, CG15  */

    /* CCM CCGR6 */
    kCLOCK_UsbOh3               = (6U << 8U) | CCM_CCGR6_CG0_SHIFT,        /*!< CCGR6, CG0   */
    kCLOCK_Usdhc1               = (6U << 8U) | CCM_CCGR6_CG1_SHIFT,        /*!< CCGR6, CG1   */
    kCLOCK_Usdhc2               = (6U << 8U) | CCM_CCGR6_CG2_SHIFT,        /*!< CCGR6, CG2   */
    kCLOCK_Dcdc                 = (6U << 8U) | CCM_CCGR6_CG3_SHIFT,        /*!< CCGR6, CG3   */
    kCLOCK_Ipmux4               = (6U << 8U) | CCM_CCGR6_CG4_SHIFT,        /*!< CCGR6, CG4   */
    kCLOCK_FlexSpi              = (6U << 8U) | CCM_CCGR6_CG5_SHIFT,        /*!< CCGR6, CG5   */
    kCLOCK_Trng                 = (6U << 8U) | CCM_CCGR6_CG6_SHIFT,        /*!< CCGR6, CG6   */
    kCLOCK_Lpuart8              = (6U << 8U) | CCM_CCGR6_CG7_SHIFT,        /*!< CCGR6, CG7   */
    kCLOCK_Timer4               = (6U << 8U) | CCM_CCGR6_CG8_SHIFT,        /*!< CCGR6, CG8   */
    kCLOCK_Aips_tz3             = (6U << 8U) | CCM_CCGR6_CG9_SHIFT,        /*!< CCGR6, CG9   */
    kCLOCK_SimPer               = (6U << 8U) | CCM_CCGR6_CG10_SHIFT,       /*!< CCGR6, CG10  */
    kCLOCK_Anadig               = (6U << 8U) | CCM_CCGR6_CG11_SHIFT,       /*!< CCGR6, CG11  */
    kCLOCK_Lpi2c4               = (6U << 8U) | CCM_CCGR6_CG12_SHIFT,       /*!< CCGR6, CG12  */
    kCLOCK_Timer1               = (6U << 8U) | CCM_CCGR6_CG13_SHIFT,       /*!< CCGR6, CG13  */
    kCLOCK_Timer2               = (6U << 8U) | CCM_CCGR6_CG14_SHIFT,       /*!< CCGR6, CG14  */
    kCLOCK_Timer3               = (6U << 8U) | CCM_CCGR6_CG15_SHIFT,       /*!< CCGR6, CG15  */

} clock_ip_name_t;

/*! @brief OSC 24M sorce select */
typedef enum _clock_osc
{
    kCLOCK_RcOsc                = 0U,      /*!< On chip OSC. */
    kCLOCK_XtalOsc              = 1U,      /*!< 24M Xtal OSC */
} clock_osc_t;

/*! @brief Clock gate value */
typedef enum _clock_gate_value
{
    kCLOCK_ClockNotNeeded      = 0U,       /*!< Clock is off during all modes. */
    kCLOCK_ClockNeededRun      = 1U,       /*!< Clock is on in run mode, but off in WAIT and STOP modes */
    kCLOCK_ClockNeededRunWait  = 3U,       /*!< Clock is on during all modes, except STOP mode */
} clock_gate_value_t;

/*! @brief System clock mode */
typedef enum _clock_mode_t
{
    kCLOCK_ModeRun              = 0U,      /*!< Remain in run mode. */
    kCLOCK_ModeWait             = 1U,      /*!< Transfer to wait mode. */
    kCLOCK_ModeStop             = 2U,      /*!< Transfer to stop mode. */
} clock_mode_t;


/*!
 * @brief MUX control names for clock mux setting.
 *
 * These constants define the mux control names for clock mux setting.\n
 * - 0:7: REG offset to CCM_BASE in bytes.
 * - 8:15: Root clock setting bit field shift.
 * - 16:31: Root clock setting bit field width.
 */
typedef enum _clock_mux
{
    kCLOCK_Pll3SwMux      = CCM_TUPLE(CCSR, CCM_CCSR_PLL3_SW_CLK_SEL_SHIFT, CCM_CCSR_PLL3_SW_CLK_SEL_MASK, CCM_NO_BUSY_WAIT),                         /*!< pll3_sw_clk mux name */

    kCLOCK_PeriphMux      = CCM_TUPLE(CBCDR, CCM_CBCDR_PERIPH_CLK_SEL_SHIFT, CCM_CBCDR_PERIPH_CLK_SEL_MASK, CCM_CDHIPR_PERIPH_CLK_SEL_BUSY_SHIFT),    /*!< periph mux name */
    kCLOCK_SemcAltMux     = CCM_TUPLE(CBCDR, CCM_CBCDR_SEMC_ALT_CLK_SEL_SHIFT, CCM_CBCDR_SEMC_ALT_CLK_SEL_MASK, CCM_NO_BUSY_WAIT),                    /*!< semc mux name */
    kCLOCK_SemcMux        = CCM_TUPLE(CBCDR, CCM_CBCDR_SEMC_CLK_SEL_SHIFT, CCM_CBCDR_SEMC_CLK_SEL_MASK, CCM_NO_BUSY_WAIT),                            /*!< semc mux name */    
   
    kCLOCK_PrePeriphMux   = CCM_TUPLE(CBCMR, CCM_CBCMR_PRE_PERIPH_CLK_SEL_SHIFT, CCM_CBCMR_PRE_PERIPH_CLK_SEL_MASK, CCM_NO_BUSY_WAIT),                /*!< pre-periph mux name */
    kCLOCK_TraceMux       = CCM_TUPLE(CBCMR, CCM_CBCMR_TRACE_CLK_SEL_SHIFT, CCM_CBCMR_TRACE_CLK_SEL_MASK, CCM_NO_BUSY_WAIT),                          /*!< trace mux name */
    kCLOCK_PeriphClk2Mux  = CCM_TUPLE(CBCMR, CCM_CBCMR_PERIPH_CLK2_SEL_SHIFT, CCM_CBCMR_PERIPH_CLK2_SEL_MASK, CCM_NO_BUSY_WAIT),                      /*!< periph clock2 mux name */
    kCLOCK_LpspiMux       = CCM_TUPLE(CBCMR, CCM_CBCMR_LPSPI_CLK_SEL_SHIFT, CCM_CBCMR_LPSPI_CLK_SEL_MASK, CCM_NO_BUSY_WAIT),                          /*!< lpspi mux name */

